utn-fra-lse/lpc845/ejemplos/sdks/01_blinky_sdk/components/mem_manager/fsl_component_mem_manager.c
#ifdef MEM_STATISTICS_INTERNAL
#ifdef MEM_MANAGER_BENCH
    MEM_BufferAllocates_memStatis(buffer, ALLOC_TIME, numBytes);
#else
    MEM_BufferAllocates_memStatis(buffer, 0, numBytes);
#endif

    if ((s_memStatis.nb_alloc % NB_ALLOC_REPORT_THRESHOLD) == 0U)
    {
        MEM_Reports_memStatis();
    }
#endif /* MEM_STATISTICS_INTERNAL */
#if (defined(MEM_MANAGER_ENABLE_TRACE) && (MEM_MANAGER_ENABLE_TRACE > 0U))
    if (pPool->allocatedBlocks > pPool->allocatedBlocksPeak)
    {
        pPool->allocatedBlocksPeak = pPool->allocatedBlocks;
    }
    fragmentWaste = pPool->blockSize - numBytes;
    if (fragmentWaste > pPool->poolFragmentWastePeak)
    {
        pPool->poolFragmentWastePeak = (uint16_t)fragmentWaste;
    }
    pPool->poolFragmentWaste = (uint16_t)fragmentWaste;
    pPool->poolTotalFragmentWaste += (uint16_t)fragmentWaste;
    if (fragmentWaste < pPool->poolFragmentMinWaste)
    {
        pPool->poolFragmentMinWaste = (uint16_t)fragmentWaste;
    }
#endif /*MEM_MANAGER_ENABLE_TRACE*/
    MEM_EXIT_CRITICAL();
    return buffer;
}

/*!
 * @brief Memory buffer free.
 *
 * @param buffer                     The memory buffer address will be free.
 * @retval kStatus_MemSuccess        Memory free succeed.
 * @retval kStatus_MemFreeError      Memory free error occurred.
 */
mem_status_t MEM_BufferFree(void *buffer /* IN: Block of memory to free*/
)
{
    block_list_header_t *pBlock;
    mem_pool_structure_t *pPool = s_memmanager.pHeadPool;
    MEM_ENTER_CRITICAL();

    do
    {
        if (NULL == buffer)
        {
            break;
        }
#if defined(MEM_STATISTICS_INTERNAL)
        MEM_BufferFrees_memStatis(buffer);
#endif /* MEM_STATISTICS_INTERNAL */
        pBlock = (block_list_header_t *)buffer - 1;
        assert(pBlock);
        if (1U == pBlock->allocated)
        {
            (void)memset(pBlock, 0x0, (sizeof(block_list_header_t) + (uint32_t)pBlock->blockSize));
            MEM_EXIT_CRITICAL();
            while (true)
            {
                if (((uint32_t)pPool->pHeap <= (uint32_t)pBlock) &&
                    ((uint32_t)pBlock <
                     (uint32_t)pPool->pHeap +
                         pPool->numBlocks * ((uint32_t)pPool->blockSize + (uint32_t)sizeof(block_list_header_t))))
                {
                    pPool->allocatedBlocks--;
                    return kStatus_MemSuccess;
                }
                pPool = pPool->nextPool;
                if (NULL == pPool)
                {
                    return kStatus_MemFreeError;
                }
            }
        }

#if (defined(MEM_MANAGER_ENABLE_TRACE) && (MEM_MANAGER_ENABLE_TRACE > 0U))
        s_memmanager.freeFailures++;
#endif /*MEM_MANAGER_ENABLE_TRACE*/

    } while (false);

    MEM_EXIT_CRITICAL();
    return kStatus_MemFreeError;
}

/*!
 * @brief Returns the size of a given buffer.
 *
 * @param buffer                     The memory buffer address will be free.
 * @retval The size of a given buffer.
 */
uint16_t MEM_BufferGetSize(void *buffer) /* IN: Block of memory to get size*/
{
    block_list_header_t *pBlock;
    assert(buffer);

    pBlock = (block_list_header_t *)buffer - 1;
    assert(pBlock);

    return pBlock->blockSize;
}

/*!
 * @brief Frees all allocated blocks by selected source and in selected pool.
 *
 * @param poolId                     Selected pool Id (4 LSBs of poolId parameter) and selected
 *                                   source Id (4 MSBs of poolId parameter).
 * @retval kStatus_MemSuccess        Memory free succeed.
 * @retval kStatus_MemFreeError      Memory free error occurred.
 */
mem_status_t MEM_BufferFreeAllWithId(uint8_t poolId)
{
    mem_pool_structure_t *pPool = s_memmanager.pHeadPool;

    MEM_ENTER_CRITICAL();

    while (pPool != NULL)
    {
        if (pPool->poolId == poolId)
        {
            (void)memset(pPool->pHeap, 0x0,
                         ((sizeof(block_list_header_t) + (uint32_t)pPool->blockSize) * pPool->numBlocks));
#if (defined(MEM_MANAGER_ENABLE_TRACE) && (MEM_MANAGER_ENABLE_TRACE > 0U))
            pPool->allocatedBlocksPeak    = 0;
            pPool->poolTotalFragmentWaste = 0;
            pPool->poolFragmentWaste      = 0;
            pPool->poolFragmentWastePeak  = 0;
            pPool->poolFragmentMinWaste   = 0xffff;
#endif /*MEM_MANAGER_ENABLE_TRACE*/
            pPool->allocatedBlocks = 0;
        }
        pPool = pPool->nextPool;
    }

    MEM_EXIT_CRITICAL();
    return kStatus_MemSuccess;
}

mem_status_t MEM_BufferCheck(void *buffer, uint32_t size)
{
    /* NOT IMPLEMENTED */
    (void)buffer;
    (void)size;
    return kStatus_MemUnknownError;
}

/*!
 * @brief Memory buffer realloc.
 *
 * @param buffer                     The memory buffer address will be reallocated.
 * @param new_size                   The number of bytes will be reallocated
 * @retval kStatus_MemSuccess        Memory free succeed.
 * @retval kStatus_MemFreeError      Memory free error occurred.
 */
void *MEM_BufferRealloc(void *buffer, uint32_t new_size)
{
    void *realloc_buffer = NULL;
    uint16_t block_size  = 0U;

    if (new_size == 0U)
    {
        /* new requested size is 0, free old buffer */
        (void)MEM_BufferFree(buffer);
        realloc_buffer = NULL;
    }
    else if (buffer == NULL)
    {
        /* input buffer is NULL simply allocate a new buffer and return it */
        realloc_buffer = MEM_BufferAllocWithId(new_size, 0U);
    }
    else
    {
        block_size = MEM_BufferGetSize(buffer);

        if ((uint16_t)new_size <= block_size)
        {
            /* current buffer is large enough for the new requested size
               we can still use it */
            realloc_buffer = buffer;
        }
        else
        {
            /* not enough space in the current block, creating a new one */
            realloc_buffer = MEM_BufferAllocWithId(new_size, 0U);

            if (realloc_buffer != NULL)
            {
                /* copy input buffer data to new buffer */
                (void)memcpy(realloc_buffer, buffer, (uint32_t)block_size);

                /* free old buffer */
                (void)MEM_BufferFree(buffer);
            }
        }
    }

    return realloc_buffer;
}

/*!
 * @brief Get the address after the last allocated block if MemManagerLight is used.
 *
 * @retval 0      Return 0 in case of the legacy MemManager.
 */
uint32_t MEM_GetHeapUpperLimit(void)
{
    return 0U;
}

/*!
 * @brief Get the free space in the heap.
 *
 * @retval 0      Return 0 in case of the legacy MemManager.
 */
uint32_t MEM_GetFreeHeapSize(void)
{
    return 0U;
}

/*!
 * @brief Trace memory manager all information to use debug.
 *
 */
#if (defined(MEM_MANAGER_ENABLE_TRACE) && (MEM_MANAGER_ENABLE_TRACE > 0U))
void MEM_Trace(void)
{
    mem_pool_structure_t *pPool = s_memmanager.pHeadPool;
    block_list_header_t *pBlock;
    (void)PRINTF("MEM_Trace debug information, Pools Number:%d   allocationFailures: %d  freeFailures:%d\r\n",
                 s_memmanager.poolNum, s_memmanager.allocationFailures, s_memmanager.allocationFailures,
                 s_memmanager.freeFailures);
    while (NULL != pPool)
    {
        (void)PRINTF("POOL: ID %d  blockSize:%d   status:\r\n", pPool->poolId, pPool->blockSize);
        (void)PRINTF(
            "numBlocks allocatedBlocks  allocatedBlocksPeak  poolFragmentWaste poolFragmentWastePeak "
            "poolFragmentMinWaste poolTotalFragmentWaste\r\n");
        (void)PRINTF(
            "    %d          %d                %d                %d                  %d                       %d       "
            "              %d\r\n",
            pPool->numBlocks, pPool->allocatedBlocks, pPool->allocatedBlocksPeak, pPool->poolFragmentWaste,
            pPool->poolFragmentWastePeak, pPool->poolFragmentMinWaste, pPool->poolTotalFragmentWaste);
        (void)PRINTF("Currently pool meory block allocate status:\r\n");
        for (uint32_t i = 0; i < pPool->numBlocks; i++)
        {
            pBlock = (block_list_header_t *)(void *)(pPool->pHeap +
                                                     i * ((uint32_t)pPool->blockSize + sizeof(block_list_header_t)));

            (void)PRINTF("Block %d caller : 0x%x Allocated %d bytes: %d\r\n", i, pBlock->caller, pBlock->allocated,
                         pBlock->allocatedBytes);
        }
        /* Try next pool*/
        pPool = pPool->nextPool;
    }
}
#endif /*MEM_MANAGER_ENABLE_TRACE*/
#endif /*gMemManagerLight*/
